 doves/app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    params[:per_page] = 10 if params[:per_page].nil?
	 @submissions = Submission.all if params[:search].nil?

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", "about"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
---
  def show

  #if (admin or reviewer) AND (submission is pending and date votable is today or before today)
  # pull in all vote information about this submission and display
  # if reviewer has voted in this round displayr reviewers vote and all previous round info
  # if reviewer has not voted display option to vote anda ll previous round info
  # vote array (votes)
  # INFO TO DISPLAY: submissions voting date,
  #					 each reviewers vote and comments from previous rounds
  #					 current round
  #					 option to vote if reviewer has not voted yet

    @submission = Submission.find(params[:id])
	@vote = Vote.new
	@hasVoted = true
	subStatus = @submission.status
	subId = @submission.id
	if (isadmin? || isreviewer?) && subStatus == "pending"
		#get all votes that have an s_id equal to this submission
		@votes = @submission.votes
		#@comments array will hold all previous comments for display on the screen :M
		@oldRecords = []
		@submission.votes.each{|vote| @oldRecords.push(Record.new(User.find(vote.user_id).first_name,vote.created_at,vote.comments,vote.round))}

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @submission = Submission.find(params[:id])

SELECT "birds".* FROM "birds" WHERE "birds"."common_name" = '' LIMIT 1
INSERT INTO "submissions" ("admin_notes", "age", "bird_id", "common_name", "coobservers", "created_at", "created_on", "date_accepted", "date_votable", "detailed_behavior", "detailed_description", "distance_from", "distinguished_char", "gps", "guide_use", "habitat", "length_of_obs", "location", "media", "notes", "num_of_birds", "optical_equipment", "plumage", "prev_bird_exp", "references", "region", "rounds", "s_degree", "sex", "sight_date_time", "status", "sub_fname", "sub_lname", "sub_recall", "unusual", "updated_at", "updated_on", "user_id", "working_notes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @submission = Submission.new(params[:submission])
	@submission.rounds = 1
	@submission.user_id = session[:user].id
	@bird = Bird.find_by_common_name(@submission.common_name)
	if @bird.nil? then
		@submission.bird_id=31  #default to "Other" if we don't find a bird with that name
	else
		@submission.bird_id = @bird.id
		@submission.common_name=nil
	end
	5.times {@submission.multimedia.build}

	# if we clicked the "Save as Draft" submit button
	if params[:commit].downcase == "save as draft"
		@submission.status = "incomplete"
	end

    respond_to do |format|
      if @submission.save

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "submissions" SET "plumage" = 'I dont think age should allow characters!', "updated_at" = '2013-02-20 23:11:35.082691' WHERE "submissions"."id" = 2
---
  def update
    @submission = Submission.find(params[:id])

	params[:submission][:rounds] = @submission.rounds if !isadmin?
	params[:submission][:status] = @submission.status if !isadmin?

	@bird = Bird.find_by_common_name(params[:submission][:common_name])
	if @bird.nil? then
		params[:submission][:bird_id]=31  #default to "Other" if we don't find a bird with that name
	else
		params[:submission][:bird_id] = @bird.id
		params[:submission][:common_name]=nil
	end

	# if we clicked the "Save as Draft" submit button
	if params[:commit].downcase == "save as draft"
		@submission.status = "incomplete"
	elsif params[:commit].downcase == "submit"
		@submission.status = "new"
	end

    respond_to do |format|
      if @submission.update_attributes(params[:submission])

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "submissions" WHERE "submissions"."id" = ?  [["id", 2]]
---
  def destroy
    @submission = Submission.find(params[:id])
    @submission.destroy