 doves/app/controllers/votes_controller.rb

  def show
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
	@count = 1
    @submission = Submission.find(params[:submission_id])
    @vote = @submission.votes.new(params[:vote])
	@vote.user_id = session[:user].id
	@vote.round = @submission.rounds

    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("Submission_id", "User_id", "comments", "created_at", "round", "time", "updated_at", "vote") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @vote = Vote.find(params[:id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]