 doves/app/views/submissions/_form.html.erb

SELECT "birds".* FROM "birds" WHERE "birds"."common_name" = 'Barnacle Goose' LIMIT 1
---
});
   var birdArray = <%= Bird.all.map(&:common_name).sort.to_json.html_safe %>;