 doves/app/views/submissions/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
		<% end %></td>
	<td><%= submission.user.first_name%>&nbsp<%= submission.user.last_name %></td>