trunk/ doves/app/controllers/birds_controller.rb

  def index
    @birds = Bird.order('birds.position asc').search(params[:search])
---
SELECT "birds".* FROM "birds"

  def show
    @bird = Bird.find(params[:id])
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @bird = Bird.find(params[:id])
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @bird = Bird.new(params[:bird])

    respond_to do |format|
      if @bird.save
---
INSERT INTO "birds" ("common_name", "created_at", "reviewable", "updated_at") VALUES (?, ?, ?, ?)  [["common_name", "Black-bellied Whistling-Duck"], ["created_at", Wed, 20 Feb 2013 18:26:39 UTC +00:00], ["reviewable", "Yes"], ["updated_at", Wed, 20 Feb 2013 18:26:39 UTC +00:00]]

  def update
    @bird = Bird.find(params[:id])
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @bird = Bird.find(params[:id])
    @bird.destroy
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "birds" WHERE "birds"."id" = ?  [["id", 3]]