trunk/ doves/app/controllers/users_controller.rb

	def login_attempt
		authorized_user = User.authenticate(params[:email],params[:login_password])
		if authorized_user
			session[:user] = authorized_user
			flash[:notice] = "Successfully logged in as #{authorized_user.first_name} #{authorized_user.last_name}."
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'rake@doves.org' LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("address_line1", "address_line2", "city", "created_at", "email", "encrypted_password", "first_name", "last_name", "level", "phone", "prev_exp", "salt", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "first_name" = 'Aasf', "last_name" = 'Sufyani', "salt" = '$2a$10$.K8ULljKABxoKWv8WQwMMe', "encrypted_password" = '$2a$10$.K8ULljKABxoKWv8WQwMMe22/G..P0cF/IhUG00HfmqVEDlWaiITe', "updated_at" = '2013-02-27 19:38:01.468062' WHERE "users"."id" = 1