trunk/ doves/app/controllers/votes_controller.rb

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @vote = Vote.find(params[:id])

INSERT INTO "votes" ("Submission_id", "User_id", "comments", "created_at", "round", "time", "updated_at", "vote") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vote = Vote.new(params[:vote])

    respond_to do |format|
      if @vote.save

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @vote = Vote.find(params[:id])